Revit 2027 API
StructuralConnectionSettings.IncludeWarningControls Property
 This property controls how Structural Connection Element is generated. If set to true and warnings are reported for given Element, additional yellow triangle is displayed.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IncludeWarningControls { get; set; }
Public Property IncludeWarningControls As Boolean
	Get
	Set
public:
property bool IncludeWarningControls {
	bool get ();
	void set (bool value);
}
member IncludeWarningControls : bool with get, set
Property Value
Boolean
See Also
Reference
StructuralConnectionSettings Class
Autodesk.Revit.DB.Structure Namespace